Tekla.Structures.Drawing.Weld
The Weld class contains methods related to welds.
A weld is a drawing object derived from a model object.
It represents a drawing weld that has a reference to the
actual weld in the model database.

Tekla.Structures.Drawing.Weld.Modify
Calls the system to update/modify the weld.
Returns: True on success.

Tekla.Structures.Drawing.Weld.Insert
NOT YET IMPLEMENTED.
Returns: False.